{"class_name": "Model", "config": {"name": "vggface_resnet50", "layers": [{"name": "input_9", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 224, 224, 3], "dtype": "float32", "sparse": false, "name": "input_9"}, "inbound_nodes": []}, {"name": "conv1/7x7_s2", "class_name": "Conv2D", "config": {"name": "conv1/7x7_s2", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [7, 7], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_9", 0, 0, {}]]]}, {"name": "conv1/7x7_s2/bn", "class_name": "BatchNormalization", "config": {"name": "conv1/7x7_s2/bn", "trainable": true, "dtype": "float32", "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv1/7x7_s2", 0, 0, {}]]]}, {"name": "activation_370", "class_name": "Activation", "config": {"name": "activation_370", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["conv1/7x7_s2/bn", 0, 0, {}]]]}, {"name": "max_pooling2d_9", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_9", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["activation_370", 0, 0, {}]]]}, {"name": "conv2_1_1x1_reduce", "class_name": "Conv2D", "config": {"name": "conv2_1_1x1_reduce", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling2d_9", 0, 0, {}]]]}, {"name": "conv2_1_1x1_reduce/bn", "class_name": "BatchNormalization", "config": {"name": "conv2_1_1x1_reduce/bn", "trainable": true, "dtype": "float32", "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2_1_1x1_reduce", 0, 0, {}]]]}, {"name": "activation_371", "class_name": "Activation", "config": {"name": "activation_371", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["conv2_1_1x1_reduce/bn", 0, 0, {}]]]}, {"name": "conv2_1_3x3", "class_name": "Conv2D", "config": {"name": "conv2_1_3x3", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_371", 0, 0, {}]]]}, {"name": "conv2_1_3x3/bn", "class_name": "BatchNormalization", "config": {"name": "conv2_1_3x3/bn", "trainable": true, "dtype": "float32", "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2_1_3x3", 0, 0, {}]]]}, {"name": "activation_372", "class_name": "Activation", "config": {"name": "activation_372", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["conv2_1_3x3/bn", 0, 0, {}]]]}, {"name": "conv2_1_1x1_increase", "class_name": "Conv2D", "config": {"name": "conv2_1_1x1_increase", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_372", 0, 0, {}]]]}, {"name": "conv2_1_1x1_proj", "class_name": "Conv2D", "config": {"name": "conv2_1_1x1_proj", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling2d_9", 0, 0, {}]]]}, {"name": "conv2_1_1x1_increase/bn", "class_name": "BatchNormalization", "config": {"name": "conv2_1_1x1_increase/bn", "trainable": true, "dtype": "float32", "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2_1_1x1_increase", 0, 0, {}]]]}, {"name": "conv2_1_1x1_proj/bn", "class_name": "BatchNormalization", "config": {"name": "conv2_1_1x1_proj/bn", "trainable": true, "dtype": "float32", "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2_1_1x1_proj", 0, 0, {}]]]}, {"name": "add_121", "class_name": "Add", "config": {"name": "add_121", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["conv2_1_1x1_increase/bn", 0, 0, {}], ["conv2_1_1x1_proj/bn", 0, 0, {}]]]}, {"name": "activation_373", "class_name": "Activation", "config": {"name": "activation_373", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["add_121", 0, 0, {}]]]}, {"name": "conv2_2_1x1_reduce", "class_name": "Conv2D", "config": {"name": "conv2_2_1x1_reduce", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_373", 0, 0, {}]]]}, {"name": "conv2_2_1x1_reduce/bn", "class_name": "BatchNormalization", "config": {"name": "conv2_2_1x1_reduce/bn", "trainable": true, "dtype": "float32", "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2_2_1x1_reduce", 0, 0, {}]]]}, {"name": "activation_374", "class_name": "Activation", "config": {"name": "activation_374", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["conv2_2_1x1_reduce/bn", 0, 0, {}]]]}, {"name": "conv2_2_3x3", "class_name": "Conv2D", "config": {"name": "conv2_2_3x3", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_374", 0, 0, {}]]]}, {"name": "conv2_2_3x3/bn", "class_name": "BatchNormalization", "config": {"name": "conv2_2_3x3/bn", "trainable": true, "dtype": "float32", "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2_2_3x3", 0, 0, {}]]]}, {"name": "activation_375", "class_name": "Activation", "config": {"name": "activation_375", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["conv2_2_3x3/bn", 0, 0, {}]]]}, {"name": "conv2_2_1x1_increase", "class_name": "Conv2D", "config": {"name": "conv2_2_1x1_increase", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_375", 0, 0, {}]]]}, {"name": "conv2_2_1x1_increase/bn", "class_name": "BatchNormalization", "config": {"name": "conv2_2_1x1_increase/bn", "trainable": true, "dtype": "float32", "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2_2_1x1_increase", 0, 0, {}]]]}, {"name": "add_122", "class_name": "Add", "config": {"name": "add_122", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["conv2_2_1x1_increase/bn", 0, 0, {}], ["activation_373", 0, 0, {}]]]}, {"name": "activation_376", "class_name": "Activation", "config": {"name": "activation_376", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["add_122", 0, 0, {}]]]}, {"name": "conv2_3_1x1_reduce", "class_name": "Conv2D", "config": {"name": "conv2_3_1x1_reduce", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_376", 0, 0, {}]]]}, {"name": "conv2_3_1x1_reduce/bn", "class_name": "BatchNormalization", "config": {"name": "conv2_3_1x1_reduce/bn", "trainable": true, "dtype": "float32", "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2_3_1x1_reduce", 0, 0, {}]]]}, {"name": "activation_377", "class_name": "Activation", "config": {"name": "activation_377", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["conv2_3_1x1_reduce/bn", 0, 0, {}]]]}, {"name": "conv2_3_3x3", "class_name": "Conv2D", "config": {"name": "conv2_3_3x3", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_377", 0, 0, {}]]]}, {"name": "conv2_3_3x3/bn", "class_name": "BatchNormalization", "config": {"name": "conv2_3_3x3/bn", "trainable": true, "dtype": "float32", "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2_3_3x3", 0, 0, {}]]]}, {"name": "activation_378", "class_name": "Activation", "config": {"name": "activation_378", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["conv2_3_3x3/bn", 0, 0, {}]]]}, {"name": "conv2_3_1x1_increase", "class_name": "Conv2D", "config": {"name": "conv2_3_1x1_increase", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_378", 0, 0, {}]]]}, {"name": "conv2_3_1x1_increase/bn", "class_name": "BatchNormalization", "config": {"name": "conv2_3_1x1_increase/bn", "trainable": true, "dtype": "float32", "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2_3_1x1_increase", 0, 0, {}]]]}, {"name": "add_123", "class_name": "Add", "config": {"name": "add_123", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["conv2_3_1x1_increase/bn", 0, 0, {}], ["activation_376", 0, 0, {}]]]}, {"name": "activation_379", "class_name": "Activation", "config": {"name": "activation_379", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["add_123", 0, 0, {}]]]}, {"name": "conv3_1_1x1_reduce", "class_name": "Conv2D", "config": {"name": "conv3_1_1x1_reduce", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_379", 0, 0, {}]]]}, {"name": "conv3_1_1x1_reduce/bn", "class_name": "BatchNormalization", "config": {"name": "conv3_1_1x1_reduce/bn", "trainable": true, "dtype": "float32", "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv3_1_1x1_reduce", 0, 0, {}]]]}, {"name": "activation_380", "class_name": "Activation", "config": {"name": "activation_380", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["conv3_1_1x1_reduce/bn", 0, 0, {}]]]}, {"name": "conv3_1_3x3", "class_name": "Conv2D", "config": {"name": "conv3_1_3x3", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_380", 0, 0, {}]]]}, {"name": "conv3_1_3x3/bn", "class_name": "BatchNormalization", "config": {"name": "conv3_1_3x3/bn", "trainable": true, "dtype": "float32", "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv3_1_3x3", 0, 0, {}]]]}, {"name": "activation_381", "class_name": "Activation", "config": {"name": "activation_381", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["conv3_1_3x3/bn", 0, 0, {}]]]}, {"name": "conv3_1_1x1_increase", "class_name": "Conv2D", "config": {"name": "conv3_1_1x1_increase", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_381", 0, 0, {}]]]}, {"name": "conv3_1_1x1_proj", "class_name": "Conv2D", "config": {"name": "conv3_1_1x1_proj", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [1, 1], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_379", 0, 0, {}]]]}, {"name": "conv3_1_1x1_increase/bn", "class_name": "BatchNormalization", "config": {"name": "conv3_1_1x1_increase/bn", "trainable": true, "dtype": "float32", "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv3_1_1x1_increase", 0, 0, {}]]]}, {"name": "conv3_1_1x1_proj/bn", "class_name": "BatchNormalization", "config": {"name": "conv3_1_1x1_proj/bn", "trainable": true, "dtype": "float32", "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv3_1_1x1_proj", 0, 0, {}]]]}, {"name": "add_124", "class_name": "Add", "config": {"name": "add_124", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["conv3_1_1x1_increase/bn", 0, 0, {}], ["conv3_1_1x1_proj/bn", 0, 0, {}]]]}, {"name": "activation_382", "class_name": "Activation", "config": {"name": "activation_382", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["add_124", 0, 0, {}]]]}, {"name": "conv3_2_1x1_reduce", "class_name": "Conv2D", "config": {"name": "conv3_2_1x1_reduce", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_382", 0, 0, {}]]]}, {"name": "conv3_2_1x1_reduce/bn", "class_name": "BatchNormalization", "config": {"name": "conv3_2_1x1_reduce/bn", "trainable": true, "dtype": "float32", "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv3_2_1x1_reduce", 0, 0, {}]]]}, {"name": "activation_383", "class_name": "Activation", "config": {"name": "activation_383", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["conv3_2_1x1_reduce/bn", 0, 0, {}]]]}, {"name": "conv3_2_3x3", "class_name": "Conv2D", "config": {"name": "conv3_2_3x3", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_383", 0, 0, {}]]]}, {"name": "conv3_2_3x3/bn", "class_name": "BatchNormalization", "config": {"name": "conv3_2_3x3/bn", "trainable": true, "dtype": "float32", "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv3_2_3x3", 0, 0, {}]]]}, {"name": "activation_384", "class_name": "Activation", "config": {"name": "activation_384", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["conv3_2_3x3/bn", 0, 0, {}]]]}, {"name": "conv3_2_1x1_increase", "class_name": "Conv2D", "config": {"name": "conv3_2_1x1_increase", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_384", 0, 0, {}]]]}, {"name": "conv3_2_1x1_increase/bn", "class_name": "BatchNormalization", "config": {"name": "conv3_2_1x1_increase/bn", "trainable": true, "dtype": "float32", "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv3_2_1x1_increase", 0, 0, {}]]]}, {"name": "add_125", "class_name": "Add", "config": {"name": "add_125", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["conv3_2_1x1_increase/bn", 0, 0, {}], ["activation_382", 0, 0, {}]]]}, {"name": "activation_385", "class_name": "Activation", "config": {"name": "activation_385", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["add_125", 0, 0, {}]]]}, {"name": "conv3_3_1x1_reduce", "class_name": "Conv2D", "config": {"name": "conv3_3_1x1_reduce", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_385", 0, 0, {}]]]}, {"name": "conv3_3_1x1_reduce/bn", "class_name": "BatchNormalization", "config": {"name": "conv3_3_1x1_reduce/bn", "trainable": true, "dtype": "float32", "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv3_3_1x1_reduce", 0, 0, {}]]]}, {"name": "activation_386", "class_name": "Activation", "config": {"name": "activation_386", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["conv3_3_1x1_reduce/bn", 0, 0, {}]]]}, {"name": "conv3_3_3x3", "class_name": "Conv2D", "config": {"name": "conv3_3_3x3", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_386", 0, 0, {}]]]}, {"name": "conv3_3_3x3/bn", "class_name": "BatchNormalization", "config": {"name": "conv3_3_3x3/bn", "trainable": true, "dtype": "float32", "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv3_3_3x3", 0, 0, {}]]]}, {"name": "activation_387", "class_name": "Activation", "config": {"name": "activation_387", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["conv3_3_3x3/bn", 0, 0, {}]]]}, {"name": "conv3_3_1x1_increase", "class_name": "Conv2D", "config": {"name": "conv3_3_1x1_increase", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_387", 0, 0, {}]]]}, {"name": "conv3_3_1x1_increase/bn", "class_name": "BatchNormalization", "config": {"name": "conv3_3_1x1_increase/bn", "trainable": true, "dtype": "float32", "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv3_3_1x1_increase", 0, 0, {}]]]}, {"name": "add_126", "class_name": "Add", "config": {"name": "add_126", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["conv3_3_1x1_increase/bn", 0, 0, {}], ["activation_385", 0, 0, {}]]]}, {"name": "activation_388", "class_name": "Activation", "config": {"name": "activation_388", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["add_126", 0, 0, {}]]]}, {"name": "conv3_4_1x1_reduce", "class_name": "Conv2D", "config": {"name": "conv3_4_1x1_reduce", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_388", 0, 0, {}]]]}, {"name": "conv3_4_1x1_reduce/bn", "class_name": "BatchNormalization", "config": {"name": "conv3_4_1x1_reduce/bn", "trainable": true, "dtype": "float32", "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv3_4_1x1_reduce", 0, 0, {}]]]}, {"name": "activation_389", "class_name": "Activation", "config": {"name": "activation_389", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["conv3_4_1x1_reduce/bn", 0, 0, {}]]]}, {"name": "conv3_4_3x3", "class_name": "Conv2D", "config": {"name": "conv3_4_3x3", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_389", 0, 0, {}]]]}, {"name": "conv3_4_3x3/bn", "class_name": "BatchNormalization", "config": {"name": "conv3_4_3x3/bn", "trainable": true, "dtype": "float32", "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv3_4_3x3", 0, 0, {}]]]}, {"name": "activation_390", "class_name": "Activation", "config": {"name": "activation_390", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["conv3_4_3x3/bn", 0, 0, {}]]]}, {"name": "conv3_4_1x1_increase", "class_name": "Conv2D", "config": {"name": "conv3_4_1x1_increase", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_390", 0, 0, {}]]]}, {"name": "conv3_4_1x1_increase/bn", "class_name": "BatchNormalization", "config": {"name": "conv3_4_1x1_increase/bn", "trainable": true, "dtype": "float32", "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv3_4_1x1_increase", 0, 0, {}]]]}, {"name": "add_127", "class_name": "Add", "config": {"name": "add_127", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["conv3_4_1x1_increase/bn", 0, 0, {}], ["activation_388", 0, 0, {}]]]}, {"name": "activation_391", "class_name": "Activation", "config": {"name": "activation_391", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["add_127", 0, 0, {}]]]}, {"name": "conv4_1_1x1_reduce", "class_name": "Conv2D", "config": {"name": "conv4_1_1x1_reduce", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [1, 1], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_391", 0, 0, {}]]]}, {"name": "conv4_1_1x1_reduce/bn", "class_name": "BatchNormalization", "config": {"name": "conv4_1_1x1_reduce/bn", "trainable": true, "dtype": "float32", "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv4_1_1x1_reduce", 0, 0, {}]]]}, {"name": "activation_392", "class_name": "Activation", "config": {"name": "activation_392", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["conv4_1_1x1_reduce/bn", 0, 0, {}]]]}, {"name": "conv4_1_3x3", "class_name": "Conv2D", "config": {"name": "conv4_1_3x3", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_392", 0, 0, {}]]]}, {"name": "conv4_1_3x3/bn", "class_name": "BatchNormalization", "config": {"name": "conv4_1_3x3/bn", "trainable": true, "dtype": "float32", "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv4_1_3x3", 0, 0, {}]]]}, {"name": "activation_393", "class_name": "Activation", "config": {"name": "activation_393", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["conv4_1_3x3/bn", 0, 0, {}]]]}, {"name": "conv4_1_1x1_increase", "class_name": "Conv2D", "config": {"name": "conv4_1_1x1_increase", "trainable": true, "dtype": "float32", "filters": 1024, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_393", 0, 0, {}]]]}, {"name": "conv4_1_1x1_proj", "class_name": "Conv2D", "config": {"name": "conv4_1_1x1_proj", "trainable": true, "dtype": "float32", "filters": 1024, "kernel_size": [1, 1], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_391", 0, 0, {}]]]}, {"name": "conv4_1_1x1_increase/bn", "class_name": "BatchNormalization", "config": {"name": "conv4_1_1x1_increase/bn", "trainable": true, "dtype": "float32", "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv4_1_1x1_increase", 0, 0, {}]]]}, {"name": "conv4_1_1x1_proj/bn", "class_name": "BatchNormalization", "config": {"name": "conv4_1_1x1_proj/bn", "trainable": true, "dtype": "float32", "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv4_1_1x1_proj", 0, 0, {}]]]}, {"name": "add_128", "class_name": "Add", "config": {"name": "add_128", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["conv4_1_1x1_increase/bn", 0, 0, {}], ["conv4_1_1x1_proj/bn", 0, 0, {}]]]}, {"name": "activation_394", "class_name": "Activation", "config": {"name": "activation_394", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["add_128", 0, 0, {}]]]}, {"name": "conv4_2_1x1_reduce", "class_name": "Conv2D", "config": {"name": "conv4_2_1x1_reduce", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_394", 0, 0, {}]]]}, {"name": "conv4_2_1x1_reduce/bn", "class_name": "BatchNormalization", "config": {"name": "conv4_2_1x1_reduce/bn", "trainable": true, "dtype": "float32", "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv4_2_1x1_reduce", 0, 0, {}]]]}, {"name": "activation_395", "class_name": "Activation", "config": {"name": "activation_395", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["conv4_2_1x1_reduce/bn", 0, 0, {}]]]}, {"name": "conv4_2_3x3", "class_name": "Conv2D", "config": {"name": "conv4_2_3x3", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_395", 0, 0, {}]]]}, {"name": "conv4_2_3x3/bn", "class_name": "BatchNormalization", "config": {"name": "conv4_2_3x3/bn", "trainable": true, "dtype": "float32", "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv4_2_3x3", 0, 0, {}]]]}, {"name": "activation_396", "class_name": "Activation", "config": {"name": "activation_396", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["conv4_2_3x3/bn", 0, 0, {}]]]}, {"name": "conv4_2_1x1_increase", "class_name": "Conv2D", "config": {"name": "conv4_2_1x1_increase", "trainable": true, "dtype": "float32", "filters": 1024, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_396", 0, 0, {}]]]}, {"name": "conv4_2_1x1_increase/bn", "class_name": "BatchNormalization", "config": {"name": "conv4_2_1x1_increase/bn", "trainable": true, "dtype": "float32", "axis": 3, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv4_2_1x1_increase", 0, 0, {}]]]}, {"name": "add_129", "class_name": "Add", "config": {"name": "add_129", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["conv4_2_1x1_increase/bn", 0, 0, {}], ["activation_394", 0, 0, {}]]]}, {"name": "activation_397", "class_name": "Activation", "config": {"name": "activation_397", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["add_129", 0, 0, {}]]]}, {"name": "conv4_3_1x1_reduce", "class_name": "Conv2D", "config": {"name": "conv4_3_1x1_reduce", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": 